micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_bsec.c
  * @author  MCD Application Team
  * @brief   BSEC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of Boot and SECurity (BSEC):
  *           + Initialization and de-initialization functions
  *
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]

     *** General Configuration ***
    ============================================================
    [..]

      (+) Call the function HAL_BSEC_GetStatus() to get the status of BSEC
    peripheral.

      (+) Call the function HAL_BSEC_GlobalLock() to lock the write to BSEC
    registers.

      (+) Call the function HAL_BSEC_GetGlobalLockStatus() to get the global
    write registers lock status.

      (+) Call the function HAL_BSEC_GetErrorCode() to get the error code
    raised when API return HAL_ERROR.

     *** OTP Management ***
    ============================================================
    [..]

      (+) Call the function HAL_BSEC_OTP_Read() to read the value of
    an OTP fuse.

      (+) Call the function HAL_BSEC_OTP_Program() to program an OTP
    fuse with or without permanent lock.

      (+) Call the function HAL_BSEC_OTP_Reload() to reload an OTP
    fuse value.

      (+) Call the function HAL_BSEC_OTP_Lock() to sticky lock
    an OTP fuse programming, writing shadowed register or reload.

      (+) Call the function HAL_BSEC_OTP_GetState() to get the sticky lock
    status (programming, writing shadowed register or reload), the permanent
    lock status, the shadow configuration, the ECC or hidden status of an
    OTP fuse.


     *** Shadow fuse register management ***
    [..]

      (+) Call the function HAL_BSEC_OTP_ReadShadow() to read the value of
    a shadow fuse register.

      (+) Call the function HAL_BSEC_OTP_WriteShadow() to write in a shadow
    fuse register.

      (+) Call the function HAL_BSEC_OTP_GetShadowState() to
    get the validity status of a shadow fuse register.

     *** Device lifecycle management ***
    ============================================================
    [..]

      (+) Call the function HAL_BSEC_GetDeviceLifeCycleState() to get the
    BSEC device lifecycle state.

      (+) Call the function HAL_BSEC_ReadEpochCounter() to read the value
    of epoch counter.

      (+) Call the function HAL_BSEC_SelectEpochCounter() to select the
    epoch counter used by SAES.

      (+) Call the function HAL_BSEC_GetEpochCounterSelection() to get
    the epoch counter selection for SAES.

     *** HDPL management ***
    ============================================================
        [..]

      (+) Call the function HAL_BSEC_GetHDPLValue() to get the current HDPL.

      (+) Call the function HAL_BSEC_IncrementHDPLValue() to increment the HDPL.

      (+) Call the function HAL_BSEC_ConfigSAESHDPLIncrementValue() to configure
    the increment of HDPL sent to SAES.

      (+) Call the function HAL_BSEC_GetSAESHDPLIncrementValue() to get the SAES
    increment to HDPL.

         *** Scratch register management ***
    ============================================================
    [..]

      (+) Call the function HAL_BSEC_WriteScratchValue() to write a value in
    write once scratch or scratch register.

      (+) Call the function HAL_BSEC_ReadScratchValue() to read a value from
    write once scratch or scratch register.


         *** Debug management ***
    ============================================================
    [..]

      (+) Call the function HAL_BSEC_GetDebugRequest() to get the debug
    request of host debugger.

      (+) Call the function HAL_BSEC_SendJTAGData() to send data via JTAG.

      (+) Call the function HAL_BSEC_ReceiveJTAGData() to receive data
    via JTAG.

      (+) Call the function HAL_BSEC_ConfigDebug() to configure the HDPL,
    secure and non-secure authorization for debugger.

      (+) Call the function HAL_BSEC_GetDebugConfig() to get the HDPL,
    secure and non-secure authorization of debug.

      (+) Call the function HAL_BSEC_LockDebug() to lock the debug.

      (+) Call the function HAL_BSEC_UnlockDebug() to unlock the debug.

      (+) Call the function HAL_BSEC_GetDebugLockState() to get the debug
    lock status.

         *** DHUK management ***
    ============================================================
        [..]

      (+) Call the function HAL_BSEC_GetDHUKValidity() to get the validity
    of DHUK.

      (+) Call the function HAL_BSEC_LockDHUKUse() to lock the DHUK use.

      (+) Call the function HAL_BSEC_GetDHUKLockStatus() to get the DHUK
    lock status.

         *** Reset counter ***
    ============================================================
        [..]

      (+) Call the function HAL_BSEC_GetNumberOfResets() to get the number
    of hot or warm resets.
  @endverbatim

  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

#if defined(HAL_BSEC_MODULE_ENABLED)

/** @defgroup BSEC BSEC
  * @brief BSEC HAL module driver.
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup BSEC_Private_Constants BSEC Private Constants
  * @{
  */
#define BSEC_HDPL_INCREMENT_CODE     0x60B166E7U
#define BSEC_NB_FUSES                376U
#define BSEC_LIMIT_UPPER_FUSES       256U
#define BSEC_NB_SHADOW_REG           BSEC_NB_FUSES
#define BSEC_NB_EPOCH_COUNTER        2U
#define BSEC_NB_SCRATCH_REG          4U
#define BSEC_NB_WOSCR_REG            8U
#define BSEC_OTPSR_RELOAD_ERRORS     (BSEC_OTPSR_DISTURBF | BSEC_OTPSR_DEDF | BSEC_OTPSR_AMEF)
#define BSEC_SHADOW_REG_WRITE_LIMIT  9U
#define BSEC_TIMEOUT                 1000U
/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup BSEC_Private_Functions BSEC Private Functions
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

