micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
/** @defgroup BSEC_Exported_Functions BSEC Exported Functions
  * @{
  */

/** @defgroup BSEC_Exported_Functions_Group1 General configuration functions
 *  @brief   General configuration functions
 *
@verbatim
 ===============================================================================
                ##### General configuration functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to perform global
  configuration of BSEC.

@endverbatim
  * @{
  */

/**
  * @brief  Get the status of BSEC peripheral.
  *
  * @param  hbsec   BSEC handle
  * @param  pStatus  Returned value of BSEC status. The returned value is @ref BSEC_Status
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetStatus(BSEC_HandleTypeDef * hbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
 if ((pStatus == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  *pStatus = (hbsec->Instance->OTPSR & (BSEC_OTPSR_INIT_DONE | BSEC_OTPSR_HIDEUP | BSEC_OTPSR_OTPNVIR));

  return HAL_OK;
}

/**
  * @brief  Lock the write to BSEC registers.
  *
  * @param  hbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GlobalLock(BSEC_HandleTypeDef *hbsec)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Set the value of global lock */
  SET_BIT(hbsec->Instance->LOCKR, BSEC_LOCKR_GWLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the global write registers lock status.
  *
  * @param  hbsec  BSEC handle
  * @param  pStatus  Returned value of global lock status. The returned value is @ref BSEC_Global_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetGlobalLockStatus(BSEC_HandleTypeDef * hbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pStatus == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Get the global lock status */
  *pStatus = (hbsec->Instance->LOCKR & BSEC_LOCKR_GWLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the error code of BSEC driver.
  *
  * @param  hbsec  BSEC handle
  * @param  pError  Returned value of error code. The returned value is @ref BSEC_Error_Code
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetErrorCode(BSEC_HandleTypeDef * hbsec, uint32_t *pError)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value */
 if (pError == NULL)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  *pError = hbsec->ErrorCode;

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group2 OTP fuse management functions
 *  @brief   OTP fuse management functions
 *
@verbatim
 ===============================================================================
                  ##### OTP fuse management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the OTP fuses.

@endverbatim
  * @{
  */

/**
  * @brief  Read OTP fuse value.
  *
  * @param  hbsec     BSEC handle
  * @param  FuseId     Fuse to be read, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  pFuseData  Returned value of fuse. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Read(BSEC_HandleTypeDef * hbsec, uint32_t FuseId, uint32_t *pFuseData)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
 if ((pFuseData == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  if (FuseId < BSEC_NB_FUSES)
  {
    /* Reload the data :
       - Unshadowed fuse are not automatically reload and data no more available after register read
       - Shadowed fuse contains by default the shadow value in the register */
    if (HAL_BSEC_OTP_Reload(hbsec, FuseId) == HAL_OK)
    {
      /* Read data from shadow register */
      *pFuseData = hbsec->Instance->FVRw[FuseId];
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Program an OTP fuse with or without permanent lock.
  *
  * @param  hbsec    BSEC handle
  * @param  FuseId    Fuse to be written, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  FuseData  Data to be written in fuse, this parameter value is between 0 and 0xFFFFFFFFU
  * @param  Lock      Permanent lock value, this parameter is @ref BSEC_Permanent_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Program(BSEC_HandleTypeDef *hbsec, uint32_t FuseId, uint32_t FuseData, uint32_t Lock)
{
  uint32_t status_reg;
  uint32_t status_bit;
  uint32_t read_data;
  uint32_t tick_start = HAL_GetTick();

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the permanent lock */
  assert_param(IS_BSEC_PERMANENT_LOCK(Lock));

  /* Get the correct register value */
  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    if ((hbsec->Instance->SPLOCKx[status_reg] & status_bit) == 0U)
    {
      /* Write data in register */
      hbsec->Instance->WDR = FuseData;

      /* Perform a program of the fuse register */
      MODIFY_REG(hbsec->Instance->OTPCR, (BSEC_OTPCR_PPLOCK | BSEC_OTPCR_PROG | BSEC_OTPCR_ADDR),
                                         (FuseId | BSEC_OTPCR_PROG | Lock));

      /* Wait the operation is finished */
      while ((hbsec->Instance->OTPSR & BSEC_OTPSR_BUSY) != 0U)
      {
        if ((HAL_GetTick() - tick_start) > BSEC_TIMEOUT)
        {
          hbsec->ErrorCode = HAL_BSEC_ERROR_TIMEOUT;
          return HAL_ERROR;
        }
      }

      /* Check programming errors */
      if ((hbsec->Instance->OTPSR & BSEC_OTPSR_PROGFAIL) != 0U)
      {
        hbsec->ErrorCode = HAL_BSEC_ERROR_PROGFAIL;
        return HAL_ERROR;
      }

      /* Read back programmed data */
      if (HAL_BSEC_OTP_Read(hbsec, FuseId, &read_data) == HAL_OK)
      {
        /* Verify programmed data */
        if (read_data != FuseData)
        {
          hbsec->ErrorCode = HAL_BSEC_ERROR_PROGFAIL;
          return HAL_ERROR;
        }
      }
      else
      {
        return HAL_ERROR;
      }
    }
    else
    {
      /* Fuse is sticky programming locked */
      hbsec->ErrorCode = HAL_BSEC_ERROR_LOCK;
      return HAL_ERROR;
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Reload a OTP fuse value.
  *
  * @param  hbsec  BSEC handle
  * @param  FuseId  Fuse to be reload, this parameter value is between 0 and BSEC_NB_FUSES-1
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Reload(BSEC_HandleTypeDef *hbsec, uint32_t FuseId)
{
  uint32_t status_reg;
  uint32_t status_bit;
  uint32_t tick_start = HAL_GetTick();

