micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    if ((hbsec->Instance->SRLOCKx[status_reg] & status_bit) == 0U)
    {
      /* Perform a reload of the fuse register */
      MODIFY_REG(hbsec->Instance->OTPCR, (BSEC_OTPCR_PPLOCK | BSEC_OTPCR_PROG | BSEC_OTPCR_ADDR), FuseId);

      /* Wait the operation is finished */
      while ((hbsec->Instance->OTPSR & BSEC_OTPSR_BUSY) != 0U)
      {
        if ((HAL_GetTick() - tick_start) > BSEC_TIMEOUT)
        {
          hbsec->ErrorCode = HAL_BSEC_ERROR_TIMEOUT;
          return HAL_ERROR;
        }
      }

      if ((hbsec->Instance->OTPSR & BSEC_OTPSR_RELOAD_ERRORS) != 0U)
      {
        /* An error occurred during reloading, value can't be relied on */
        hbsec->ErrorCode = (hbsec->Instance->OTPSR & BSEC_OTPSR_RELOAD_ERRORS);
        return HAL_ERROR;
      }
    }
    else
    {
      /* Shadow register is sticky reload locked */
      hbsec->ErrorCode = HAL_BSEC_ERROR_LOCK;
      return HAL_ERROR;
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Sticky lock an OTP fuse programming, writing shadowed register or reload.
  *
  * @param  hbsec  BSEC handle
  * @param  FuseId  Fuse to lock, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  Lock    Lock status of the fuse, this parameter is a combination of
  *                   @ref HAL_BSEC_FUSE_PROG_LOCKED,
  *                   @ref HAL_BSEC_FUSE_WRITE_LOCKED,
  *                   @ref HAL_BSEC_FUSE_RELOAD_LOCKED
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Lock(BSEC_HandleTypeDef *hbsec, uint32_t FuseId, uint32_t Lock)
{
  uint32_t status_reg;
  uint32_t status_bit;

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the lock configuration */
  assert_param(IS_BSEC_LOCK_CFG(Lock));

  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    if ((Lock & HAL_BSEC_FUSE_PROG_LOCKED) != 0U)
    {
      /* Programming lock */
      SET_BIT(hbsec->Instance->SPLOCKx[status_reg], status_bit);
    }

    if ((Lock & HAL_BSEC_FUSE_WRITE_LOCKED) != 0U)
    {
      /* Write lock */
      SET_BIT(hbsec->Instance->SWLOCKx[status_reg], status_bit);
    }

    if ((Lock & HAL_BSEC_FUSE_RELOAD_LOCKED) != 0U)
    {
      /* Reload lock */
      SET_BIT(hbsec->Instance->SRLOCKx[status_reg], status_bit);
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Get the sticky lock status (programming, writing shadowed register
  *         or reload), the permanent lock status, the shadow configuration,
  *         the ECC or hidden status of an OTP fuse.
  *
  * @param  hbsec  BSEC handle
  * @param  FuseId  Fuse to get the state, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  pState  Returned value of state. The returned value is a combination of @ref BSEC_State
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_GetState(BSEC_HandleTypeDef * hbsec, uint32_t FuseId, uint32_t *pState)
{
  uint32_t status_reg;
  uint32_t status_bit;
  uint32_t otpsr_reg;
  uint32_t state;

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
 if ((pState == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    /* Initialize return value */
    state = 0U;

    /* Check sticky programming lock */
    if ((hbsec->Instance->SPLOCKx[status_reg] & status_bit) != 0U)
    {
      state |= HAL_BSEC_FUSE_PROG_LOCKED;
    }

    /* Check sticky write lock */
    if ((hbsec->Instance->SWLOCKx[status_reg] & status_bit) != 0U)
    {
      state |= HAL_BSEC_FUSE_WRITE_LOCKED;
    }

    /* Check sticky reload lock */
    if ((hbsec->Instance->SRLOCKx[status_reg] & status_bit) != 0U)
    {
      state |= HAL_BSEC_FUSE_RELOAD_LOCKED;
    }
    else
    {
      /* Check permanent lock : only in case of reload allowed as OTPSR reflect
         status of most recently read word */
      if (HAL_BSEC_OTP_Reload(hbsec, FuseId) == HAL_OK)
      {
        otpsr_reg = hbsec->Instance->OTPSR;

        if ((otpsr_reg & BSEC_OTPSR_PPLF) != 0u)
        {
          /* Permanent programming lock detected */
          state |= HAL_BSEC_FUSE_LOCKED;
        }
        else if ((otpsr_reg & BSEC_OTPSR_PPLMF) != 0U)
        {
          /* Permanent programming lock on the two lower fuse values in the array are not identical */
          hbsec->ErrorCode = HAL_BSEC_ERROR_PPLM;
          return HAL_ERROR;
        }
        else
        {
          /* No permanent programming lock detected */
        }
      }
    }

    /* Check shadow configuration */
    if ((hbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      state |= HAL_BSEC_FUSE_SHADOWED;
    }

    /* Check hidden status */
    if (((hbsec->Instance->OTPSR & BSEC_OTPSR_HIDEUP) != 0U) &&
        (FuseId >= BSEC_LIMIT_UPPER_FUSES))
    {
      state |= HAL_BSEC_FUSE_HIDDEN;
    }

    /* Check ECC errors on all OTP fuses */
    state |= (hbsec->Instance->OTPSR & (BSEC_OTPSR_OTPERR | BSEC_OTPSR_OTPSEC));

  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }
  *pState = state;
  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group3 Shadow fuse register management functions
 *  @brief   Shadow fuse register management functions
 *
@verbatim
 ===============================================================================
             ##### Shadow fuse register management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  shadow fuse registers.

@endverbatim
  * @{
  */

/**
  * @brief  Read the value of a shadow fuse register.
  *
  * @param  hbsec    BSEC handle
  * @param  RegId     Shadow register to be read, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  pRegData  Returned value of register data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_ReadShadow(BSEC_HandleTypeDef * hbsec, uint32_t RegId, uint32_t *pRegData)
{
  uint32_t status_reg;
  uint32_t status_bit;

