micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pRegData == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  if (RegId < BSEC_NB_SHADOW_REG)
  {
    status_reg = RegId / 32U;
    status_bit = (uint32_t)(1UL << (RegId % 32U));

    if ((hbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      /* Read data from shadow register */
      *pRegData = hbsec->Instance->FVRw[RegId];
    }
    else
    {
      /* Fuse is not shadowed */
      hbsec->ErrorCode = HAL_BSEC_ERROR_UNALLOWED;
      return HAL_ERROR;
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Write in a shadow fuse register.
  *
  * @param  hbsec    BSEC handle
  * @param  RegId     Shadow register to be written, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  RegData   Data to be written in shadow register, this parameter value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_WriteShadow(BSEC_HandleTypeDef *hbsec, uint32_t RegId, uint32_t RegData)
{
  uint32_t status_reg;
  uint32_t status_bit;

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Get the correct register value */
  if ((RegId > BSEC_SHADOW_REG_WRITE_LIMIT) && (RegId < BSEC_NB_SHADOW_REG))
  {
    status_reg = RegId / 32U;
    status_bit = (uint32_t)(1UL << (RegId % 32U));

    if ((hbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      if ((hbsec->Instance->SWLOCKx[status_reg] & status_bit) == 0U)
      {
        /* Value is written in register */
        hbsec->Instance->FVRw[RegId] = RegData;
      }
      else
      {
        /* Shadow register is sticky write locked */
        hbsec->ErrorCode = HAL_BSEC_ERROR_LOCK;
        return HAL_ERROR;
      }
    }
    else
    {
      /* Fuse is not shadowed */
      hbsec->ErrorCode = HAL_BSEC_ERROR_UNALLOWED;
      return HAL_ERROR;
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Get the validity status of a shadow register.
  *
  * @param  hbsec     BSEC handle
  * @param  RegId      Shadow register to be checked, this parameter value is between 0 and BSEC_NB_FUSES-1
  * @param  pValidity  Returned value of validity status. The returned value is @ref BSEC_Reload_Validity
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_GetShadowState(BSEC_HandleTypeDef * hbsec, uint32_t RegId, uint32_t *pValidity)
{
  uint32_t status_reg;
  uint32_t status_bit;

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
 if ((pValidity == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  if (RegId < BSEC_NB_SHADOW_REG)
  {
    status_reg = RegId / 32U;
    status_bit = (uint32_t)(1UL << (RegId % 32U));

    if ((hbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      if ((hbsec->Instance->OTPVLDRx[status_reg] & status_bit) != 0U)
      {
        *pValidity = HAL_BSEC_RELOAD_DONE;
      }
      else
      {
        *pValidity = HAL_BSEC_RELOAD_ERROR;
      }
    }
    else
    {
      /* Fuse is not shadowed */
      hbsec->ErrorCode = HAL_BSEC_ERROR_UNALLOWED;
      return HAL_ERROR;
    }
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group4 Device lifecycle management functions
 *  @brief   Device lifecycle management functions
 *
@verbatim
 ===============================================================================
               ##### Device lifecycle management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  device lifecycle.

@endverbatim
  * @{
  */

/**
  * @brief  Get the BSEC device lifecycle state.
  *
  * @param  hbsec  BSEC handle
  * @param  pState  Returned value of device lifecycle state. The returned value is @ref BSEC_Lifecycle_State
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDeviceLifeCycleState(BSEC_HandleTypeDef * hbsec, uint32_t *pState)
{

  uint32_t state;
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
 if ((pState == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return the state */
  state = (hbsec->Instance->SR & BSEC_SR_NVSTATE);

  if (IS_BSEC_STATE(state))
  {
    *pState = state;
    return HAL_OK;
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_UNDEFINED_VALUE;
    return HAL_ERROR;
  }
}

/**
  * @brief  Read the value of epoch counter.
  *
  * @param  hbsec        BSEC handle
  * @param  CounterId     Identifier of the epoch counter to be read, this parameter can be @ref BSEC_Epoch_Select
  * @param  pCounterData  Returned value of epoch counter data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ReadEpochCounter(BSEC_HandleTypeDef * hbsec, uint32_t CounterId, uint32_t *pCounterData)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
 if ((pCounterData == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

