micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
  /* Get the correct register value */
  if (CounterId < BSEC_NB_EPOCH_COUNTER)
  {
    *pCounterData = hbsec->Instance->EPOCHRx[CounterId];
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Select the epoch counter used by SAES.
  *
  * @param  hbsec            BSEC handle
  * @param  SelectedCounter   Epoch selected counter, this parameter can be @ref BSEC_Epoch_Select
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_SelectEpochCounter(BSEC_HandleTypeDef *hbsec, uint32_t SelectedCounter)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the epoch counter selection */
  assert_param(IS_BSEC_EPOCHSEL(SelectedCounter));

  /* Update the selected epoch counter value */
  MODIFY_REG(hbsec->Instance->EPOCHSELR, BSEC_EPOCHSELR_EPSEL, SelectedCounter);

  return HAL_OK;
}

/**
  * @brief  Get the epoch counter selection for SAES.
  *
  * @param  hbsec            BSEC handle
  * @param  pSelectedCounter  Returned value of epoch selected counter. The returned value is @ref BSEC_Epoch_Select
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetEpochCounterSelection(BSEC_HandleTypeDef * hbsec, uint32_t *pSelectedCounter)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pSelectedCounter == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return the debug request */
  *pSelectedCounter = (hbsec->Instance->EPOCHSELR & BSEC_EPOCHSELR_EPSEL);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group5 HDPL management functions
 *  @brief   HDPL management functions
 *
@verbatim
 ===============================================================================
                     ##### HDPL management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  HDPL (Hide Protection Level).

@endverbatim
  * @{
  */

/**
  * @brief  Get the current HDPL.
  *
  * @param  hbsec  BSEC handle
  * @param  pHDPL   Returned value of current HDPL. The returned value is @ref BSEC_HDPL
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetHDPLValue(BSEC_HandleTypeDef * hbsec, uint32_t *pHDPL)
{

  uint32_t hdpl;
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pHDPL == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return the HDPL */
  hdpl = (hbsec->Instance->HDPLSR & BSEC_HDPLSR_HDPL);

  if (IS_BSEC_HDPL(hdpl))
  {
    *pHDPL = hdpl;
    return HAL_OK;
  }
  else
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_UNDEFINED_VALUE;
    return HAL_ERROR;
  }
}

/**
  * @brief  Increment the HDPL.
  *
  * @param  hbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_IncrementHDPLValue(BSEC_HandleTypeDef *hbsec)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Increment HDPL value */
  hbsec->Instance->HDPLCR = BSEC_HDPL_INCREMENT_CODE;

  return HAL_OK;
}

/**
  * @brief  Configure the increment of HDPL sent to SAES.
  *
  * @param  hbsec      BSEC handle
  * @param  Increment   Value of HDPL increment, this parameter can be a value of @ref BSEC_INCR_HDPL
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ConfigSAESHDPLIncrementValue(BSEC_HandleTypeDef *hbsec, uint32_t Increment)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
 if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_NEXTHDPL(Increment));

  /* Write HDPL increment value */
  MODIFY_REG(hbsec->Instance->NEXTLR, BSEC_NEXTLR_INCR, Increment);

  return HAL_OK;
}

/**
  * @brief  Get the SAES increment to HDPL.
  *
  * @param  hbsec      BSEC handle
  * @param  pIncrement  Returned value of HDPL increment. The returned value is a value of @ref BSEC_INCR_HDPL
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetSAESHDPLIncrementValue(BSEC_HandleTypeDef * hbsec, uint32_t *pIncrement)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pIncrement == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return the debug request */
  *pIncrement = (hbsec->Instance->NEXTLR & BSEC_NEXTLR_INCR);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group6 Scratch registers management functions
 *  @brief   Scratch registers management functions
 *
@verbatim
 ===============================================================================
               ##### Scratch registers management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  write once scratch and scratch registers.

@endverbatim
  * @{
  */

/**
  * @brief  Write a value in write once scratch or scratch register.
  *
  * @param  hbsec     BSEC handle
  * @param  pRegAddr  Register to be written
  * @param  Value     Value to be written, this parameter can be a value between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_WriteScratchValue(BSEC_HandleTypeDef *hbsec, const BSEC_ScratchRegTypeDef *pRegAddr, uint32_t Value)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the register configuration and instance */
 if ((pRegAddr == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_REGTYPE(pRegAddr->RegType));

  /* Write data in correct register */
  if (pRegAddr->RegType == HAL_BSEC_SCRATCH_REG)
  {
    if (pRegAddr->RegNumber < BSEC_NB_SCRATCH_REG)
    {
      hbsec->Instance->SCRATCHRx[pRegAddr->RegNumber] = Value;
    }
    else
    {
      hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
      return HAL_ERROR;
    }
  }
  else
  {
    if (pRegAddr->RegNumber < BSEC_NB_WOSCR_REG)
    {
      hbsec->Instance->WOSCRx[pRegAddr->RegNumber] = Value;
    }
    else
    {
      hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Read a value from write once scratch or scratch register.
  *
  * @param  hbsec    BSEC handle
  * @param  pRegAddr  Register to be read
  * @param  pValue  Returned value of register data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ReadScratchValue(BSEC_HandleTypeDef * hbsec, const BSEC_ScratchRegTypeDef *pRegAddr, uint32_t *pValue)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

