micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
  /* Check the register configuration, address of returned value and instance */
 if ((pRegAddr == NULL) || (pValue == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_REGTYPE(pRegAddr->RegType));

  /* Get the correct register value */
  if (pRegAddr->RegType == HAL_BSEC_SCRATCH_REG)
  {
    if (pRegAddr->RegNumber < BSEC_NB_SCRATCH_REG)
    {
      *pValue = hbsec->Instance->SCRATCHRx[pRegAddr->RegNumber];
    }
    else
    {
      hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
      return HAL_ERROR;
    }
  }
  else
  {
    if (pRegAddr->RegNumber < BSEC_NB_WOSCR_REG)
    {
      *pValue = hbsec->Instance->WOSCRx[pRegAddr->RegNumber];
    }
    else
    {
      hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group7 Debug management functions
 *  @brief   Debug management functions
 *
@verbatim
 ===============================================================================
                   ##### Debug management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  debug functionalities.

@endverbatim
  * @{
  */

/**
  * @brief  Get the debug request of host debugger.
  *
  * @param  hbsec   BSEC handle
  * @param  pDbgReq  Returned value of debug request. The returned value is @ref BSEC_Debug_Req
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDebugRequest(BSEC_HandleTypeDef * hbsec, uint32_t *pDbgReq)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pDbgReq == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return the debug request */
  *pDbgReq = (hbsec->Instance->SR & BSEC_SR_DBGREQ);

  return HAL_OK;
}

/**
  * @brief  Send data via JTAG.
  *
  * @param  hbsec  BSEC handle
  * @param  Data    Data to be sent via JTAG, this parameter can be a value between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_SendJTAGData(BSEC_HandleTypeDef *hbsec, uint32_t Data)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Send the data */
  hbsec->Instance->JTAGOUTR = Data;

  return HAL_OK;
}

/**
  * @brief  Receive data via JTAG.
  *
  * @param  hbsec  BSEC handle
  * @param  pData   Returned value of received data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ReceiveJTAGData(BSEC_HandleTypeDef * hbsec, uint32_t *pData)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pData == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return the received data */
  *pData = hbsec->Instance->JTAGINR;

  return HAL_OK;
}

/**
  * @brief  Configure the HDPL, secure and non-secure authorization
  *         for debugger.
  *
  * @param  hbsec  BSEC handle
  * @param  pCfg    Configuration of debug
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ConfigDebug(BSEC_HandleTypeDef *hbsec, const BSEC_DebugCfgTypeDef *pCfg)
{
  uint32_t cfg_reg;

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the configuration pointer and instance */
  if ((pCfg == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_OPENDBG(pCfg->HDPL_Open_Dbg));
  assert_param(IS_BSEC_SECDBGAUTH(pCfg->Sec_Dbg_Auth));
  assert_param(IS_BSEC_NSDBGAUTH(pCfg->NonSec_Dbg_Auth));

  cfg_reg = ((pCfg->HDPL_Open_Dbg   & BSEC_DBGCR_AUTH_HDPL) \
           | (pCfg->Sec_Dbg_Auth    & BSEC_DBGCR_AUTH_SEC)  \
           | (pCfg->NonSec_Dbg_Auth & BSEC_DBGCR_UNLOCK));

  hbsec->Instance->DBGCR = cfg_reg;

  return HAL_OK;
}

/**
  * @brief  Get the HDPL, secure and non-secure authorization of debug.
  *
  * @param  hbsec   BSEC handle
  * @param  pDbgCfg  Returned value of debug configuration
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDebugConfig(BSEC_HandleTypeDef * hbsec, BSEC_DebugCfgTypeDef *pDbgCfg)
{
  uint32_t cfg_reg;

  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pDbgCfg == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Get the debug configuration */
  cfg_reg = hbsec->Instance->DBGCR;
  pDbgCfg->HDPL_Open_Dbg = (cfg_reg & BSEC_DBGCR_AUTH_HDPL);
  pDbgCfg->Sec_Dbg_Auth = (cfg_reg & BSEC_DBGCR_AUTH_SEC);
  pDbgCfg->NonSec_Dbg_Auth = (cfg_reg & BSEC_DBGCR_UNLOCK);

  return HAL_OK;
}

/**
  * @brief  Lock the debug.
  *
  * @param  hbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_LockDebug(BSEC_HandleTypeDef *hbsec)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Set the value of the debug lock */
  MODIFY_REG(hbsec->Instance->AP_UNLOCK, BSEC_AP_UNLOCK_UNLOCK, HAL_BSEC_DEBUG_LOCKED);

  return HAL_OK;
}

/**
  * @brief  Unlock the debug.
  *
  * @param  hbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_UnlockDebug(BSEC_HandleTypeDef *hbsec)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

