micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_bsec.c
  /* Check the instance */
  if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Set the value of the debug lock */
  MODIFY_REG(hbsec->Instance->AP_UNLOCK, BSEC_AP_UNLOCK_UNLOCK, HAL_BSEC_DEBUG_UNLOCKED);

  return HAL_OK;
}

/**
  * @brief  Get the debug lock status.
  *
  * @param  hbsec   BSEC handle
  * @param  pStatus  Returned value of debug lock status. The returned value is @ref BSEC_Debug_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDebugLockState(BSEC_HandleTypeDef * hbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pStatus == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Get the debug lock status */
  *pStatus = (hbsec->Instance->AP_UNLOCK & BSEC_AP_UNLOCK_UNLOCK);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group8 DHUK management functions
 *  @brief   DHUK management functions
 *
@verbatim
 ===============================================================================
                    ##### DHUK management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  DHUK (Derived Hardware Unique Key).

@endverbatim
  * @{
  */

/**
  * @brief  Get the validity of DHUK.
  *
  * @param  hbsec     BSEC handle
  * @param  pValidity  Returned value of DHUK validity. The returned value is @ref BSEC_DHUK_Validity
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDHUKValidity(BSEC_HandleTypeDef * hbsec, uint32_t *pValidity)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pValidity == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Get the DHUK validity */
  *pValidity = (hbsec->Instance->SR & BSEC_SR_HVALID);

  return HAL_OK;
}

/**
  * @brief  Lock the DHUK use.
  *
  * @param  hbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_LockDHUKUse(BSEC_HandleTypeDef *hbsec)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (hbsec->Instance != BSEC)
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Set the value of the DHUK lock */
  SET_BIT(hbsec->Instance->LOCKR, BSEC_LOCKR_HKLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the DHUK lock status.
  *
  * @param  hbsec   BSEC handle
  * @param  pStatus  Returned value of DHUK lock status. The returned value is @ref BSEC_DHUK_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDHUKLockStatus(BSEC_HandleTypeDef * hbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pStatus == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Get the DHUK lock status */
  *pStatus = (hbsec->Instance->LOCKR & BSEC_LOCKR_HKLOCK);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group9 Reset management functions
 *  @brief   Reset management functions
 *
@verbatim
 ===============================================================================
                    ##### Reset management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the reset.

@endverbatim
  * @{
  */

/**
  * @brief  Get the number of hot or warm resets.
  *
  * @param  hbsec        BSEC handle
  * @param  ResetType     Type of the reset, this parameter can be a value of @ref BSEC_Reset_Type
  * @param  pResetNumber  Returned value of number of reset. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetNumberOfResets(BSEC_HandleTypeDef * hbsec, uint32_t ResetType, uint32_t *pResetNumber)
{
  /* Check the handle pointer */
  if (hbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pResetNumber == NULL) || (hbsec->Instance != BSEC))
  {
    hbsec->ErrorCode = HAL_BSEC_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Check the reset type */
  assert_param(IS_BSEC_RESETTYPE(ResetType));

  /* Get the correct register value */
  if (ResetType == HAL_BSEC_HOT_RESET)
  {
    *pResetNumber = hbsec->Instance->HRCR;
  }
  else
  {
    *pResetNumber = hbsec->Instance->WRCR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* HAL_BSEC_MODULE_ENABLED */

/**
  * @}
  */

